Revit 2026 API

# DuctFittingAndAccessoryPressureDropUIDataItem Class

---

Each duct fitting or duct accessory FamilyInstance has one DuctFittingAndAccessoryPressureDropUIDataItem.

SystemObject Autodesk.Revit.UI.MechanicalDuctFittingAndAccessoryPressureDropUIDataItem

**Namespace:** Autodesk.Revit.UI.Mechanical**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DuctFittingAndAccessoryPressureDropUIDataItem : IDisposable
```
```vb
Public Class DuctFittingAndAccessoryPressureDropUIDataItem
	Implements IDisposable
```
```cpp
public ref class DuctFittingAndAccessoryPressureDropUIDataItem : IDisposable
```
```fsharp
type DuctFittingAndAccessoryPressureDropUIDataItem =
    class
        interface IDisposable
    end
```

The DuctFittingAndAccessoryPressureDropUIDataItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DuctFittingAndAccessoryPressureDropUIDataItem |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDuctFittingAndAccessoryData | Gets the fitting data stored in the UI data item. |
|  | GetEntity | Returns the entity set by UI server. or an invalid entity otherwise. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetEntity | Stores the entity in the UI data item. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

One family instance has one UI data item. The UI data item contains a corresponding DuctFittingAndAccessoryData which is used for initialing the UI settings and an entity which is used for storing the UI settings.

#### Reference

Autodesk.Revit.UI.Mechanical Namespace